# Pandas 读取数据
1. 纯文本文件
    * csv文件
    * txt文件
2. xlsx格式excel文件
3. mysql数据表

In [15]:
import pandas as pd

## 1. 纯文本文件
### 1.1 csv文件

In [16]:
fpath = './datas/ml-latest-small/ratings.csv'

In [17]:
ratings = pd.read_csv(fpath)
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [18]:
# 数据形状，（行数，列数）
ratings.shape

(100836, 4)

In [19]:
# 查看列名
ratings.columns

Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [20]:
# 查看索引
ratings.index

RangeIndex(start=0, stop=100836, step=1)

In [21]:
# 查看每列数据类型
ratings.dtypes

userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

### 1.2 txt文件

In [22]:
fpath = './datas/crazyant/access_pvuv.txt'

In [23]:
pvuv = pd.read_csv(
    fpath,
    sep='\t',
    header=None,
    names=['pdate', 'pv', 'uv']
)
# sep分隔符，headers是否有表头，names自定义表头

In [24]:
pvuv

        pdate   pv   uv
0  2019-09-10  139   92
1  2019-09-09  185  153
2  2019-09-08  123   59
3  2019-09-07   65   40
4  2019-09-06  157   98
5  2019-09-05  205  151
6  2019-09-04  196  167
7  2019-09-03  216  176
8  2019-09-02  227  148
9  2019-09-01  105   61

## 2. excel文件

In [26]:
fpath = './datas/crazyant/access_pvuv.xlsx'
pvuv = pd.read_excel(fpath)

In [27]:
pvuv

           日期   PV   UV
0  2019-09-10  139   92
1  2019-09-09  185  153
2  2019-09-08  123   59
3  2019-09-07   65   40
4  2019-09-06  157   98
5  2019-09-05  205  151
6  2019-09-04  196  167
7  2019-09-03  216  176
8  2019-09-02  227  148
9  2019-09-01  105   61

## 3. mysql数据表

In [32]:
import pymysql
sql = pymysql.connect(
    host='127.0.0.1',
    user='root',
    password='123456',
    database='sql_store',
    charset='utf8'
)

In [33]:
pd_sql = pd.read_sql('select * from customers', con=sql)
pd_sql

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
1,2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
2,3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
3,4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
4,5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
5,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
6,7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
7,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
8,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
9,10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796